app/controllers/order_items_controller.rb

  def index
    session[:hely] << "||| id: #{params[:id]} | order_items  -  index  "
    @order_items = OrderItem.all
---
SELECT * FROM "order_items"

  def teteladatai
    session[:hely] << "||| id: #{params[:id]} | order_items  -  teteladatai  "
    @product_type = ProductType.find(params[:id])
---
SELECT * FROM "product_types" WHERE (product_category_id == 0 )

  def teteladatai_szerkeszt
    session[:hely] << "||| id: #{params[:id]} | order_items  -  teteladatai_szerkeszt  "
    session[:order_item_id] = params[:order_item_id]
    @order_item = OrderItem.find(params[:order_item_id])
    @product_type = ProductType.find(@order_item.product_type_id)
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 0)
SELECT * FROM "product_types" WHERE ("product_types"."id" = 3)

  def show
    session[:hely] << "||| id: #{params[:id]} | order_items  -  show  "

    @order_item = OrderItem.find(params[:id])
    session[:order_item_id] = @order_item.id

    szamol

    session[:order] ||= Order.create
    @order = session[:order]
    session[:order_id] = @order.id
    @order_item.order_id = @order.id
    @order_item.product_type_id = session[:product_type_id]
    @order_item.save
---
INSERT INTO "orders" ("address_szall_id", "address_szla_id", "datum_megr", "megjegyzes", "updated_at", "datum_szall", "order_status_id", "user_id", "created_at") VALUES(NULL, NULL, NULL, NULL, '2010-08-17 20:36:12', NULL, NULL, NULL, '2010-08-17 20:36:12')
SELECT * FROM "order_items" WHERE ("order_items"."id" = 1)
SELECT * FROM "order_items"
UPDATE "order_items" SET "ar_lezart" = 210, "order_id" = 25, "product_type_id" = 6, "updated_at" = '2010-08-21 13:26:29' WHERE "id" = 111

  def show_kosar
    session[:hely] << "||| id: #{params[:id]} | order_items  -  show_kosar  "
    @order = session[:order]
    @kosarka = OrderItem.all(:conditions => ["order_id == ? ", @order.id ] )
---
SELECT * FROM "order_items" WHERE (order_id == 40 )

  def destroy
    session[:hely] << "||| id: #{params[:id]} | order_items  -  destroy  "
    @order_item = OrderItem.find(params[:id])
    @order_item.destroy
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 59)
DELETE FROM "order_items" WHERE "id" = 59

  def edit
    session[:hely] << "||| id: #{params[:id]} | order_items  -  edit  "
    @order_item = OrderItem.find(params[:id])
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 63)

  def create
    session[:hely] << "||| id: #{params[:id]} | order_items  -  create  "
---
INSERT INTO "order_items" ("darab", "order_id", "updated_at", "print_id", "document_id", "paper_weight_price_id", "paper_type_id", "nev", "product_type_id", "ar_lezart", "created_at") VALUES(NULL, NULL, '2010-08-03 22:27:17', 1, NULL, NULL, NULL, '', NULL, NULL, '2010-08-03 22:27:17')

  def update
    session[:hely] << "||| id: #{params[:id]} | order_items  -  update  "
    @order_item = OrderItem.find(params[:id])

    respond_to do |format|
      if @order_item.update_attributes(params[:order_item])
---
SELECT * FROM "order_items" WHERE ("order_items"."id" = 115)
UPDATE "order_items" SET "nev" = 'lllllooooohhhhhhooooo', "updated_at" = '2010-08-21 14:22:25' WHERE "id" = 116