app/controllers/product_categories_controller.rb

  def index
    session[:hely]= []
    session[:hely] << "params[:id]: #{params[:id]} |#{params[:id]} | product_categories  -  index  "
    @product_categories = ProductCategory.all
---
SELECT * FROM "product_categories"

  def show
    session[:hely] << "params[:id]: #{params[:id]} | product_categories  -  show  "
    @product_category = ProductCategory.find(params[:id])
---
SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)

  def edit
    session[:hely] << "params[:id]: #{params[:id]} | product_categories  -  edit  "
    @product_category = ProductCategory.find(params[:id])
---
SELECT * FROM "product_categories" WHERE ("product_categories"."id" = 1)

  def create
    session[:hely] << "params[:id]: #{params[:id]} | product_categories  -  create  "
---
INSERT INTO "product_categories" ("kep", "updated_at", "nev", "leiras", "created_at") VALUES('', '2010-07-27 22:30:43', 'Képeslap', 'Itt választhatsz képeslapokat!', '2010-07-27 22:30:43')