app/controllers/product_types_controller.rb

  def index
    #@product_types = ProductType.all(:conditions => "product_category_id = '#{params[:id]}'")   - behatolható
    #@product_types = ProductType.all(:conditions => { :product_category_id => params[:category] } )    - jó, de csak egyenlőségi vizsgálatot tud
    @product_types = ProductType.all(:conditions => ["product_category_id == ? ",
                                                  params[:category].to_i ] )
---
SELECT * FROM "product_types" WHERE ("product_types"."product_category_id" = 2) LIMIT 1

  def show
    @product_type = ProductType.find(params[:id])
---
SELECT * FROM "product_types" WHERE ("product_types"."id" = 1)

  def edit
    @product_type = ProductType.find(params[:id])
---
SELECT * FROM "product_types" WHERE ("product_types"."id" = 1)

  def create
    @product_type = ProductType.new(params[:product_type])

    respond_to do |format|
      if @product_type.save
---
INSERT INTO "product_types" ("kep", "felfele_nyilo", "updated_at", "szelesseg", "product_category_id", "oldalszam", "nev", "leiras", "magassag", "created_at") VALUES(NULL, NULL, '2010-08-03 10:24:52', NULL, NULL, NULL, NULL, NULL, NULL, '2010-08-03 10:24:52')